tutorials/Zhang/U3nu1.4e-4STD0.1Trial2Case/0/alpha.wetting
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.wetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
196256
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    upperInlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    lowerInlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    rightInlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    leftInlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    walls2
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
