tutorials/Zhang/U3nu1.4e-4STD0.1Trial2Case/0/epss
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epss;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
196256
(
0.451551
0.582875
0.735365
0.4938
0.507379
0.561327
0.504748
0.549844
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
    upperInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    lowerInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    rightInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    leftInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
